# groupby() function

In [17]:
import pandas as pd

In [3]:
df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})

In [4]:
df

  Department Team Gender  Salary  Age   JoinDate
0         HR    A      M      85   23 2020-01-10
1         HR    A      F      90   25 2020-02-15
2         IT    B      M      78   30 2021-03-20
3         IT    B      F      85   22 2021-04-10
4  Marketing    C      M      92   28 2020-05-30
5  Marketing    C      F      88   26 2020-06-25
6      Sales    D      M      75   21 2021-07-15
7      Sales    D      F      80   27 2021-08-01

# Common Aggregation Functions

In [5]:
df.groupby("Department")["Salary"].mean() # Average salary of all department

Department
HR           87.5
IT           81.5
Marketing    90.0
Sales        77.5
Name: Salary, dtype: float64

In [6]:
df.groupby("Department")["Salary"].sum() # Sum of salary of all department

Department
HR           175
IT           163
Marketing    180
Sales        155
Name: Salary, dtype: int64

In [7]:
df.groupby("Department")["Salary"].count() # Total Entries

Department
HR           2
IT           2
Marketing    2
Sales        2
Name: Salary, dtype: int64

In [8]:
df.groupby("Department")["Salary"].min() # Minimum Salary

Department
HR           85
IT           78
Marketing    88
Sales        75
Name: Salary, dtype: int64

In [9]:
df.groupby("Department")["Salary"].max() # Maximum Salary

Department
HR           90
IT           85
Marketing    92
Sales        80
Name: Salary, dtype: int64

# Custom Aggregations with "agg()"

In [10]:
df.groupby("Department")["Salary"].agg(["min", "max", "sum"])

            min  max  sum
Department
HR           85   90  175
IT           78   85  163
Marketing    88   92  180
Sales        75   80  155

In [13]:
df.groupby("Team")["Salary"].agg(  
    avg_score = "mean",  # average salary per team, renamed as 'avg_score'
    high_score = "max"   # highest salary per team, renamed as 'high_score'
)

      avg_score  high_score
Team
A          87.5          90
B          81.5          85
C          90.0          92
D          77.5          80

In [21]:
df.groupby("Team").agg({
    "Salary" : "mean",   # For each 'Team', calculate the average Salary
    "Age" : "max"        # For each 'Team', find the maximum Age
})

      Salary  Age
Team
A       87.5   25
B       81.5   30
C       90.0   28
D       77.5   27

# Transform & Filter Function

In [26]:
df["Team_avg"] = df.groupby("Team")["Salary"].transform("mean") # Add team-wise average salary

In [27]:
df

  Department Team Gender  Salary  Age   JoinDate  Team_avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
2         IT    B      M      78   30 2021-03-20      81.5
3         IT    B      F      85   22 2021-04-10      81.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0
6      Sales    D      M      75   21 2021-07-15      77.5
7      Sales    D      F      80   27 2021-08-01      77.5

In [25]:
df.drop("Team_avg", axis = 1)

  Department Team Gender  Salary  Age   JoinDate
0         HR    A      M      85   23 2020-01-10
1         HR    A      F      90   25 2020-02-15
2         IT    B      M      78   30 2021-03-20
3         IT    B      F      85   22 2021-04-10
4  Marketing    C      M      92   28 2020-05-30
5  Marketing    C      F      88   26 2020-06-25
6      Sales    D      M      75   21 2021-07-15
7      Sales    D      F      80   27 2021-08-01

In [24]:
df.groupby("Team").filter(lambda x: x["Salary"].mean()>85) # Keep teams with avg salary > 85

  Department Team Gender  Salary  Age   JoinDate  Team_avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0